; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v3 ?v4)
             (pred_7 ?v6 ?v1)
             (pred_11 ?v3 ?v1)
             (pred_3 ?v11 ?v3 )
	     (pred_2 ?v3)
             (pred_12 ?v10)
             (pred_10 ?v6)
             (pred_6 ?v1)
             (pred_5 ?v3)
             (pred_1 ?v6)
             (pred_8 ?v3)
             (pred_9 ))



(:action op_3
:parameters (?v7 ?v9 ?v8 ?v12)
:precondition (and (pred_12 ?v7) (pred_12 ?v9) (pred_10 ?v8) (pred_6 ?v12)
          (pred_4 ?v7 ?v9) (pred_7 ?v8 ?v12)
                   (pred_11 ?v9 ?v12) (pred_2 ?v7) 
                   (pred_5 ?v9) (pred_1 ?v8))
:effect (and  (pred_8 ?v9) (not (pred_5 ?v9))))


(:action op_5
:parameters (?v7 ?v5)
:precondition (and (pred_12 ?v7) (pred_12 ?v5)
               (pred_2 ?v7) (pred_4 ?v7 ?v5) (pred_8 ?v5))
:effect (and (pred_2 ?v5) (not (pred_2 ?v7))))

(:action op_1
:parameters (?v7 ?v8)
:precondition (and (pred_12 ?v7) (pred_10 ?v8) 
                  (pred_2 ?v7) (pred_3 ?v8 ?v7) (pred_9 ))
:effect (and (pred_1 ?v8)
   (not (pred_3 ?v8 ?v7)) (not (pred_9 ))))


(:action op_2
:parameters (?v7 ?v2 ?v13)
:precondition (and (pred_12 ?v7) (pred_10 ?v2) (pred_10 ?v13)
                  (pred_2 ?v7) (pred_1 ?v13) (pred_3 ?v2 ?v7))
:effect (and (pred_1 ?v2) (pred_3 ?v13 ?v7)
        (not (pred_1 ?v13)) (not (pred_3 ?v2 ?v7))))

(:action op_4
:parameters (?v7 ?v8)
:precondition (and (pred_12 ?v7) (pred_10 ?v8) 
                  (pred_2 ?v7) (pred_1 ?v8))
:effect (and (pred_9 ) (pred_3 ?v8 ?v7) (not (pred_1 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_17 obj_05 obj_20 obj_02 obj_13 obj_04 obj_07 obj_03 obj_01 obj_06 obj_16 obj_12 obj_09 obj_18 obj_19 obj_14
    obj_08 obj_10
    obj_15 obj_11
    )

    (:init
       (pred_9)

       (pred_12 obj_17)
       (pred_12 obj_05)
       (pred_12 obj_20)
       (pred_12 obj_02)
       (pred_12 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_07)
       (pred_12 obj_03)
       (pred_12 obj_01)
       (pred_12 obj_06)
       (pred_12 obj_16)
       (pred_12 obj_12)
       (pred_12 obj_09)
       (pred_12 obj_18)
       (pred_12 obj_19)
       (pred_12 obj_14)
       (pred_6 obj_08)
       (pred_6 obj_10)
       (pred_10 obj_15)
       (pred_10 obj_11)

       (pred_4 obj_17 obj_13)
       (pred_4 obj_17 obj_05)
       (pred_4 obj_05 obj_04)
       (pred_4 obj_05 obj_20)
       (pred_4 obj_05 obj_17)
       (pred_4 obj_20 obj_07)
       (pred_4 obj_20 obj_02)
       (pred_4 obj_20 obj_05)
       (pred_4 obj_02 obj_03)
       (pred_4 obj_02 obj_20)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_13 obj_04)
       (pred_4 obj_13 obj_17)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_04 obj_05)
       (pred_4 obj_04 obj_13)
       (pred_4 obj_07 obj_16)
       (pred_4 obj_07 obj_03)
       (pred_4 obj_07 obj_20)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_03 obj_12)
       (pred_4 obj_03 obj_02)
       (pred_4 obj_03 obj_07)
       (pred_4 obj_01 obj_09)
       (pred_4 obj_01 obj_06)
       (pred_4 obj_01 obj_13)
       (pred_4 obj_06 obj_18)
       (pred_4 obj_06 obj_16)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_06 obj_01)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_16 obj_12)
       (pred_4 obj_16 obj_07)
       (pred_4 obj_16 obj_06)
       (pred_4 obj_12 obj_14)
       (pred_4 obj_12 obj_03)
       (pred_4 obj_12 obj_16)
       (pred_4 obj_09 obj_18)
       (pred_4 obj_09 obj_01)
       (pred_4 obj_18 obj_19)
       (pred_4 obj_18 obj_06)
       (pred_4 obj_18 obj_09)
       (pred_4 obj_19 obj_14)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_19 obj_18)
       (pred_4 obj_14 obj_12)
       (pred_4 obj_14 obj_19)
       (pred_5 obj_14)
       (pred_5 obj_19)
       (pred_11  obj_14 obj_08)
       (pred_11  obj_19 obj_10)
       (pred_8 obj_17)
       (pred_8 obj_05)
       (pred_8 obj_20)
       (pred_8 obj_02)
       (pred_8 obj_13)
       (pred_8 obj_04)
       (pred_8 obj_07)
       (pred_8 obj_03)
       (pred_8 obj_01)
       (pred_8 obj_06)
       (pred_8 obj_16)
       (pred_8 obj_12)
       (pred_8 obj_09)
       (pred_8 obj_18)

       (pred_7  obj_15 obj_08)
       (pred_7  obj_11 obj_10)
       (pred_3 obj_15 obj_05)
       (pred_3 obj_11 obj_12)
       (pred_2 obj_07)
    )

    (:goal (and
       (pred_3 obj_15 obj_02)
    ))
(:constraints
  (always (not (pred_2 obj_20)))
)
)

; plan
1. (op_5 obj_07 obj_04)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_04)
   goals met: 0 of 1
2. (op_5 obj_04 obj_05)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_05)
   goals met: 0 of 1
3. (op_1 obj_05 obj_15)
   deleted: (pred_3 obj_15 obj_05) (pred_9)
   added: (pred_1 obj_15)
   goals met: 0 of 1
4. (op_5 obj_05 obj_04)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_04)
   goals met: 0 of 1
5. (op_5 obj_04 obj_07)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_07)
   goals met: 0 of 1
6. (op_5 obj_07 obj_03)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_03)
   goals met: 0 of 1
7. (op_5 obj_03 obj_02)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_02)
   goals met: 0 of 1
8. (op_4 obj_02 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_9) (pred_3 obj_15 obj_02)
   goals met: 1 of 1
